In [1]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [2]:
df.iloc[1, 0]

1

In [5]:
df.iloc[:, 2]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [7]:
df.iloc[-2:,]

   A   B   C
3  3  13  23
4  4  14  24

In [8]:
df.iloc[:3, :2]

   A   B
0  0  10
1  1  11
2  2  12

In [9]:
df.iloc[0: len(df)-1 : 2, -1]

0    20
2    22
Name: C, dtype: int64

In [12]:
df.iloc[::2, -1]

0    20
2    22
4    24
Name: C, dtype: int64